БухЭксп/Documents/CW_Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_Оплата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_КурсовыеРазницы</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаВходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатыПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>InformationRegister.CW_РаспределениеОплатПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПодборСчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПодборАктов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДерева</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОтраженияАвансов</v8:Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАванса</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата_БВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Comment>НДС (в валюте оплаты)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперативнойЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_Оплата/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ---------------------------------------------------------------------------- 
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП

	Если (ЗначениеЗаполнено(Параметры.ЗначениеКопирования)) Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	Если (НЕ ЗначениеЗаполнено(Объект.Основание)) Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;   
	
	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма);
	//Взаиморасчеты по документу
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ВестиУчетПоПодразделениям и Не ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
			Объект.ПодразделениеОрганизации = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ПодразделениеПользователя");
		КонецЕсли;
	КонецЕсли;
	
	_ПраваДоступа();
	
	УЕ = Объект.Договор.ВзаиморасчетыВУЕ;   
	
	Элементы.Возврат.Видимость = Объект.ЭтоВозврат;
	
	_ОпределитьРежимВводаОстатков();
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	_УправлениеЭлементамиФормы();
	_СформироватьЗаголовок();
	
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);	
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

Функция _ПраваДоступа()
	// --- 
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_ОперативныйУчет");
	Если (НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	// --- 
КонецФункции
  

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	ПредставлениеДокументаОплаты = "П/п №"+Объект.Основание.НомерВходящегоДокумента+" от "+Формат(Объект.Основание.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy");
	
	// --- 
	Элементы.ОплатаОплата_БВ.Видимость = УЕ;
	Элементы.ОплатаКурс.Видимость = УЕ;
	// --- 
	Элементы.Оплата.ТолькоПросмотр = (НЕ ВводОстатков);
	Элементы.ОплатаАкт.Видимость = (НЕ ВводОстатков);
	// --- 
	Элементы.Оплата.ПоложениеКоманднойПанели = ?(ВводОстатков,ПоложениеКоманднойПанелиЭлементаФормы.Верх,ПоложениеКоманднойПанелиЭлементаФормы.Нет);
	
	// --- 
КонецПроцедуры

// --- 

&НаСервере
Процедура _ОпределитьРежимВводаОстатков()

	СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Объект.Организация, Объект.ВидЗадолженности, Объект.Дата); 

	ОперативныйУчет = СтруктураНастроек["ВедетсяОперативныйУчет"]; 
	ВводОстатков 	= СтруктураНастроек["ВводОстатков"];

КонецПроцедуры
 

// --- 

&НаКлиенте
Процедура ОплатаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	Если (Копирование) Тогда
		
		Возврат;
		
	КонецЕсли; 
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияОплаты",ЭтотОбъект); 
	// --- 
	Если (Объект.ВидЗадолженности=ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская")) Тогда
		
		СтруктураОтбора = Новый Структура("Контрагент,Договор,ПредъявленСчет",Объект.Контрагент,Объект.Договор,Истина);
		
		//Подсистема.УчетПриложенийДоговоров
		СтруктураОтбора.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров
		
		ПФ = Новый Структура("Отбор,РежимВыбора",СтруктураОтбора,Истина);
		ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаВыбора",ПФ,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе
		
		СтруктураОтбора = Новый Структура("Контрагент,Договор,ФормироватьСчет",Объект.Контрагент,Объект.Договор,Истина);
		
		//Подсистема.УчетПриложенийДоговоров
		СтруктураОтбора.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров
		
		ПФ = Новый Структура("Отбор,РежимВыбора",СтруктураОтбора,Истина);
		ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаВыбора",ПФ,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияОплаты(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		ТекСтрока = _ОбработатьВыборСчета(Ответ);
		Если (ТекСтрока <> Неопределено) Тогда
			Элементы.Оплата.ТекущаяСтрока = ТекСтрока;
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ОбработатьВыборСчета(Счет)
	// --- 
	
	ТЗСчета = Счет.Услуги.Выгрузить(,"СчетЗадолженности,Всего");
	ТЗСчета.Свернуть("СчетЗадолженности","Всего");
	// --- 
	ТекущийИдентификатор = Неопределено;
	// --- 
	Для каждого Стр Из ТЗСчета Цикл
		
		Нстр = Объект.Оплата.Добавить();
		// ---------------------------------------------------------------------------- 
		Нстр.Счет = Счет;
		Нстр.СчетЗадолженности = Стр.СчетЗадолженности;
		Нстр.СчетАванса = CW_Финансы.СчетАванса(Нстр.СчетЗадолженности);
		Нстр.Оплата = Стр.Всего;
		// --- 
		ТекущийИдентификатор = Нстр.ПолучитьИдентификатор();
		
	КонецЦикла; 
	
	Возврат(ТекущийИдентификатор);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОплатаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если (Поле = Элементы.ОплатаСчет) Тогда
		
		СтандартнаяОбработка = Ложь;
		Попытка
			ПоказатьЗначение(,Элементы.Оплата.ТекущиеДанные.Счет);
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
	ИначеЕсли (Поле = Элементы.ОплатаАкт) Тогда
		
		СтандартнаяОбработка = Ложь;
		Попытка
			ПоказатьЗначение(,Элементы.Оплата.ТекущиеДанные.Акт);
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	_СформироватьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	_СформироватьЗаголовок();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма);
	//Взаиморасчеты по документу
	
	_СформироватьЗаголовок();
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
КонецПроцедуры

&НаСервере
Функция _СформироватьЗаголовок()
	
	ЗаголовокДокумента = 
		"Оплата" + " " 
		+ ?(ЗначениеЗаполнено(Объект.ВидЗадолженности), "("+нрег(Объект.ВидЗадолженности)+")", "")
		+ ?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)")
	;
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

//Взаиморасчеты по документу
&НаКлиенте
Процедура Команда_ВзаиморасчетыПоДокументу(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда   
		Возврат;
	КонецЕсли;      
	
	Если Объект.ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская") Тогда
		ВидЗадолженности ="ДЕБИТОРСКАЯ";
	ИначеЕсли Объект.ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская") Тогда
		ВидЗадолженности ="КРЕДИТОРСКАЯ";
	КонецЕсли;

	CW_ВзаиморасчетыПоДокументуКлиент.ОткрытьФормуОтчетаВзаиморасчетыПоДокументу(ЭтаФорма, Объект.Ссылка, ВидЗадолженности);
	
КонецПроцедуры
//Взаиморасчеты по документу
